{
//Special Dialogue

//This is a conversation topic unlocked
"FirstTalk": "It's really great to get to meet you! I hope we can be great friends.$1",

"cc_Minecart":  "It should be much easier to travel through town now. Though the ride is a bit scary.",
"cc_Bus": "Coconuts are so versatile! They're tasty, they go well in desserts and drinks, and their oil is so good for your skin too.",
"cc_Boulder": "Ah, the water was straining quite a lot. It must be a relief to flow freely once again.",
"cc_Greenhouse": "A greenhouse is a wonderful thing. I'm happy you managed to obtain one.",
"movieTheater": "We have a movie theater. It's nice to see that space being repurposed.",
"cc_Complete":  "It doesn't surprise me that you gravitated towards the community here. I wonder if magic had not been at your back if you would have done as well?#$b#Regardless, I'm very happy that everyone is coming together.",
"joja_Begin": "Be careful with your choices. You are dynamic, and your actions affect more than just yourself.",
"pamHouseUpgrade": "It was so nice of you to give Pam and Penny a better home! Maybe if Pam is surrounded by wood instead of metal she can start to feel better.",
"pamHouseUpgradeAnonymous": "Did you hear that someone built Pam and Penny a house? Maybe if Pam is surrounded by wood instead of metal she can start to feel better.",

"MovieInvitation": "Oh, a movie? Of course, I’d love to go! I wonder what it’ll be about?$1",

//SPECIFIC DAY DIALOGUE
"spring_4": "Did you grow any parsnips this year, @? I bet they're fully grown already!$1",
"spring_10": "Coffee beans are actually the pit of a berry, which technically makes them a fruit!$1#$b#I just thought that was neat.$0",
"spring_12": "{{i18n:Antoine.PreEgg{{HEvent}}}}",
"spring_23": "{{i18n:Antoine.PreFlower{{HEvent}}}}",

"summer_5": "Why do people complain about burning when they eat hot peppers? They don't seem that hot to me.#$b#Emily said that birds don't think hot peppers are hot either.",
"summer_10": "{{i18n:Antoine.PreLuau{{HEvent}}}}",
"summer_27": "{{i18n:Antoine.PreJelly{{HEvent}}}}",

"fall_5": "I wonder why Juliet laughs when I talk about how big eggplants are?",
"fall_10": "Everybody talks about fall reminding them of pumpkins, but I always think about yams!#$b#They're just so tasty, and can go in anything, and they're really nice glazed or in a pie.",
"fall_15": "{{i18n:Antoine.PreFair{{HEvent}}}}",
"fall_26": "{{i18n:Antoine.PreSpirit{{HEvent}}}}",

"winter_7": "{{i18n:Antoine.PreIce{{HEvent}}}}",
"winter_24": "{{i18n:Antoine.PreFeast{{HEvent}}}}",



//LOW HEART DIALOGUE
//Spring
"spring_Mon": "I love the spring, the flowers really start singing.$1",
"spring_Tue": "",
"spring_Wed": "",
"spring_Thu": "",
"spring_Fri": "",
"spring_Sat": "",
"spring_Sun": "",

//Summer
"summer_Mon": "Everyone in town really seems to like summer time, don’t they?",
"summer_Tue": "Back home sunflower's look like big, yellow, puff balls. I was pretty surprised when they had such cute faces here!",
"summer_Wed": "",
"summer_Thu": "",
"summer_Fri": "",
"summer_Sat": "",
"summer_Sun": "",

//Fall
"fall_Mon": "It’s getting colder. I wish it could stay warm, but the colors are very nice, aren’t they?",
"fall_Tue": "",
"fall_Wed": "",
"fall_Thu": "",
"fall_Fri": "",
"fall_Sat": "",
"fall_Sun": "",

//Winter
"winter_Mon": "The snow is very pretty, and I love that there is water everywhere, even if it’s frozen. I just wish it didn’t bite me when I touched it!",
"winter_Tue": "Gus says that coffee stays warmer if you add cream to it. I wonder if that applies to hot chocolate too?",
"winter_Wed": "Nothing grows in winter but fiber and forage.#$b#Snow yams are pretty nice though.",
"winter_Thu": "",
"winter_Fri": "",
"winter_Sat": "",
"winter_Sun": "",


//6 Heart dialogue
//Spring
"spring_Mon6": "Hey, @. Out for a nice walk? Me too!",
"spring_Tue6": "",
"spring_Wed6": "",
"spring_Thu6": "",
"spring_Fri6": "",
"spring_Sat6": "",
"spring_Sun6": "",

//Summer
"summer_Mon6": "Phew! It’s getting pretty hot, huh? I really hope it rains again soon!",
"summer_Tue6": "",
"summer_Wed6": "",
"summer_Thu6": "",
"summer_Fri6": "",
"summer_Sat6": "",
"summer_Sun6": "",

//Fall
"fall_Mon6": "Ugh, it’s getting colder again. I love all the fruit and forage you can find in the fall, but I really wish it’d just stay warm.",
"fall_Tue6": "",
"fall_Wed6": "",
"fall_Thu6": "",
"fall_Fri6": "",
"fall_Sat6": "",
"fall_Sun6": "",

//Winter
"winter_Mon6": "It’s so cold! Huh? Why don’t I just use magic to warm myself up? I really try not to use too much magic just on myself. People can get really twisted up that way.",
"winter_Tue6": "",
"winter_Wed6": "",
"winter_Thu6": "",
"winter_Fri6": "",
"winter_Sat6": "",
"winter_Sun6": "",


//10 Heart dialogue
//Spring
"spring_Mon10": "It's a really nice day today! It's even nicer because I got to say hi to you.",
"spring_Tue10": "",
"spring_Wed10": "",
"spring_Thu10": "",
"spring_Fri10": "",
"spring_Sat10": "",
"spring_Sun10": "",

//Summer
"summer_Mon10": "Phew! It’s getting pretty hot, huh? I really hope it rains again soon!",
"summer_Tue10": "",
"summer_Wed10": "",
"summer_Thu10": "",
"summer_Fri10": "",
"summer_Sat10": "",
"summer_Sun10": "",

//Fall
"fall_Mon10": "Traditionally, this time of year my family and I would bless all the forage in the forest so that they get really plump and juicy. We’d have a little contest about who could make something grow the biggest!",
"fall_Tue10": "",
"fall_Wed10": "",
"fall_Thu10": "",
"fall_Fri10": "",
"fall_Sat10": "",
"fall_Sun10": "",

//Winter
"winter_Mon10": "It’s so cold! Too cold! I can’t wait for it to be warm again!",
"winter_Tue10": "",
"winter_Wed10": "",
"winter_Thu10": "",
"winter_Fri10": "",
"winter_Sat10": "",
"winter_Sun10": "",

}
